romaji_katakana = {
    'ア': 'a', 'イ': 'i', 'ウ': 'u', 'エ': 'e', 'オ': 'o', 'カ': 'ka', 'キ': 'ki', 'ク': 'ku', 'ケ': 'ke', 'コ': 'ko',
    'サ': 'sa', 'シ': 'shi', 'ス': 'su', 'セ': 'se', 'ソ': 'so', 'タ': 'ta', 'チ': 'chi', 'ツ': 'tsu', 'テ': 'te', 'ト': 'to',
    'ナ': 'na', 'ニ': 'ni', 'ヌ': 'nu', 'ネ': 'ne', 'ノ': 'no', 'ハ': 'ha', 'ヒ': 'hi', 'フ': 'fu', 'ヘ': 'he', 'ホ': 'ho',
    'マ': 'ma', 'ミ': 'mi', 'ム': 'mu', 'メ': 'me', 'モ': 'mo', 'ヤ': 'ya', 'ユ': 'yu', 'ヨ': 'yo', 'ラ': 'ra', 'リ': 'ri',
    'ル': 'ru', 'レ': 're', 'ロ': 'ro', 'ワ': 'wa', 'ヲ': 'wo', 'ン': 'n'
}

romaji_hiragana = {
    'あ': 'a', 'い': 'i', 'う': 'u', 'え': 'e', 'お': 'o', 'か': 'ka', 'き': 'ki', 'く': 'ku', 'け': 'ke', 'こ': 'ko',
    'さ': 'sa', 'し': 'shi', 'す': 'su', 'せ': 'se', 'そ': 'so', 'た': 'ta', 'ち': 'chi', 'つ': 'tsu', 'て': 'te', 'と': 'to',
    'な': 'na', 'に': 'ni', 'ぬ': 'nu', 'ね': 'ne', 'の': 'no', 'は': 'ha', 'ひ': 'hi', 'ふ': 'fu', 'へ': 'he', 'ほ': 'ho',
    'ま': 'ma', 'み': 'mi', 'む': 'mu', 'め': 'me', 'も': 'mo', 'や': 'ya', 'ゆ': 'yu', 'よ': 'yo', 'ら': 'ra', 'り': 'ri',
    'る': 'ru', 'れ': 're', 'ろ': 'ro', 'わ': 'wa', 'を': 'wo', 'ん': 'n'
}

noryoku_5 = {
    '一': 'イチ、イツ、ひとつ', 'ニ': 'ニ、ジ、ふたつ', '三': 'サン、みつ', '四': 'シ、よん、よつ', '五': 'ゴ、いつつ',
     '六': 'ロク、むつ', '七': 'シチ、なな、ななつ、なの', '八': 'ハチ、やつ', '九': 'キュウ、ク、ここのつ',
     '十': 'ジュウ、ジ、ジュ、とお', '百': 'ヒャク、ビャク、もも', '千': 'セン、ち', '万': 'マン、バン、よろず',
     '月': 'ゲツ、ガツ、つき', '火': 'カ、ひ', '水': 'スイ、みず', '木': 'モク、ボク、き', '金': 'キン、コン、かね',
     '土': 'ド、ト、つち', '日': 'ニチ、ジツ、ひ、び、か', '山': 'サン、やま', '川': 'セン、かわ', '本': 'ホン、もと',
     '気': 'キ、ケ、いき', '天': 'テン、あめ、あま', '大': 'ダイ、タイ、おおきい', '小': 'ショ、ちいさい、こ、さ',
     '高': 'コウ、たかい', '長': 'チョウ、ながい', '円': 'エン、まるい、まる', '上': 'ジョウ、うえ、あげる、あがる',
     '下': 'カ、ゲ、した、さげる、さがる、くだす、くだる、おりる、おろす', '中': 'チュウ、なか、うち', '前': 'ゼン、まえ',
     '後': 'ゴ、コウ、のち、うしろ、あと', '午': 'ゴ、うま', '時': 'ジ、とき、どき', '分': 'ブン、プン、フン、わかる、わける、わかれる',
     '半': 'ハン、なかば', '毎': 'マイ、ごと', '年': 'ネン、とし', '何': 'カ、なん、なに', '今': 'コン、いま',
     '間': 'カン、ケン、あいだ、ま', '休': 'キュウ、やすむ', '人': 'ジン、ニン、ひと', '先': 'セン、さき、まず',
     '生': 'セイ、ショウ、いきる、うまれる、なま', '学': 'ガク、まなぶ', '校': 'コウ、キョウ', '国': 'コク、くに',
     '外': 'ガイ、ゲ、そと、ほか、はずす、はずれる', '語': 'ゴ、かたる', '女': 'ジョ、ニョ、ニョウ、おんな',
     '男': 'ダン、タン、おとこ', '母': 'ボ、はは、も', '父': 'フ、ちち', '子': 'シ、ス、ツ、こ、ね', '友': 'ユウ、とも',
     '名': 'メイ、ミョウ、な', '入': 'ニュウ、ジュ、はいる、いる、いれる', '出': 'シュツ、でる、だす', '北': 'ホク、きた',
     '南': 'ナン、ナ、みなみ', '東': 'トウ、ひがし', '西': 'セイ、サイ、ス、にし', '行': 'ギョウ、コウ、いく、ゆく、おこなう',
     '来': 'ライ、くる、こ', '右': 'ウ、ユウ、みぎ', '左': 'サ、サイ、ひだり', '白': 'ハク、ビャク、しろい', '車': 'シャ、くるま',
     '雨': 'ウ、あめ、あま', '電': 'デン', '書': 'ショ、かく', '聞': 'ブン、モン、きく、きこえる', '見': 'ケン、みる、みえる、みせる',
     '話': 'ワ、はなす、はなし', '読': 'ドク、トク、トウ、よむ、よみ', '食': 'ショ、ジキ、くう、たべる'
}


noryoku_5_translate = {
    '一': 'Один', 'ニ': 'Два', '三': 'Три', '四': 'Четыре', '五': 'Пять', '六': 'Шесть', '七': 'Семь', '八': 'Восемь',
    '九': 'Девять', '十': 'Десять', '百': 'Сто', '千': 'Тысяча', '万': 'Десять тысяч', '月': 'Месяц, луна', '火': 'Огонь',
    '水': 'Вода', '木': 'Дерево', '金': 'Золото, деньги, металл', '土': 'Земля; Турция', '日': 'День, солнце, Япония',
    '山': 'Гора', '川': 'Река', '本': 'Книга, источник; основа','気': 'Настроение, дух, чувство; воздух; пар',
    '天': 'Небо, небеса; император', '大': 'Большой, великий', '小': 'Маленький', '高': 'Дорогой, высокий',
    '長': 'Длинный, долгий; начальник', '円': 'Иена; круг', '上': 'верх; верхняя часть','下': 'низ; нижняя часть',
    '中': 'Середина, центр; среди; между; в, внутри; Китай', '前': 'Впереди; раньше; перед', '後': 'Позади, сзади; после',
    '午': 'Полдень; знак Лошади', '時': 'Время; час', '分': 'Минута; часть; доля; делить; понимать, знать', '半': 'Половина',
    '毎': 'Каждый', '年': 'Год', '何': 'Что', '今': 'Сейчас, теперь', '間': 'Промежуток, интервал; среди; между',
    '休': 'Отдых; выходной; выход на пенсию', '人': 'Человек', '先': 'перед; впереди', '生': 'Жизнь', '学': 'Учёба, наука; учиться',
    '校': 'Школа', '国': 'Страна, государство', '外': 'Снаружи, вне', '語': 'Язык, речь; слово', '女': 'Женщина',
    '男': 'Мужчина', '母': 'Мать, мама', '父': 'Папа, отец', '子': 'Ребёнок, детёныш; знак Крысы', '友': 'Друг', '名': 'Имя, название',
    '入': 'Вход, входить; вставлять', '出': 'Выход, выходить; вынимать', '北': 'Север', '南': 'Юг', '東': 'Восток', '西': 'Запад',
    '行': 'Идти, ходить, ехать', '来': 'Приходить', '右': 'Правый', '左': 'Левый', '白': 'Белый', '車': 'Машина', '雨': 'Дождь',
    '電': 'Электричество', '書': 'Писать', '聞': 'Слышать, слушать, спрашивать', '見': 'Видеть, показывать',
    '話': 'Разговаривать, говорить', '読': 'Читать', '食': 'Есть; еда, пища'
}
